# Introduction To Python for Machine Learning

## Quiz tag-along code (Answers to quiz questions)

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
food_data = pd.read_csv('FoodBalanceSheets_E_Africa_NOFLAG.csv', encoding = 'latin-1')
food_data.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

1. What would be the output for?

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

Options

'l'

'i'

28

'e'

In [3]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

##### Option 4 is correct

2. Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

Options
292836.00

232118.43

3947019.23

3231287.75

287134.67

In [4]:
food_data.groupby('Element')['Y2017'].sum()

Element
Domestic supply quantity                  2088198.10
Export Quantity                            182338.80
Fat supply quantity (g/capita/day)          10253.84
Feed                                       223705.68
Food                                      1258888.28
Food supply (kcal/capita/day)              454681.00
Food supply quantity (kg/capita/yr)         48690.04
Import Quantity                            294559.09
Losses                                     160614.00
Other uses (non-food)                       91645.97
Processing                                 292836.00
Production                                2030056.89
Protein supply quantity (g/capita/day)      11842.45
Residuals                                   35500.00
Seed                                        24870.14
Stock Variation                             54316.91
Total Population - Both sexes             1112641.00
Tourist consumption                            91.00
Name: Y2017, dtype: float64

##### Option 1 is correct

3. What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

Options
10.60 and 17.01

10.60 and 8.49

135.23 and 1603.40

8.54 and 9876.77

140.92 and 1671.86

In [5]:
food_data.describe()

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
count,60943.000000,60943.000000,60943.000000,59354.000000,59395.000000,59408.000000,59437.000000,59507.000000
mean,134.265576,2687.176706,3814.856456,134.196282,135.235966,136.555222,140.917765,143.758381
std,72.605709,146.055739,2212.007033,1567.663696,1603.403984,1640.007194,1671.862359,1710.782658
min,4.000000,2501.000000,511.000000,-1796.000000,-3161.000000,-3225.000000,-1582.000000,-3396.000000
25%,74.000000,2562.000000,684.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,136.000000,2630.000000,5142.000000,0.090000,0.080000,0.080000,0.100000,0.070000
75%,195.000000,2775.000000,5511.000000,8.340000,8.460000,8.430000,9.000000,9.000000
max,276.000000,2961.000000,5911.000000,176405.000000,181137.000000,185960.000000,190873.000000,195875.000000

##### Option 4 is correct

4. If you have the following list

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = [‘Age’,’Nationality’,’Overall’]

How do you create a pandas DataFrame using this list, to look like the table below?

|  |Age|Nationality| Overall|
|---|---|---|---|
| 1 | 35 | Portugal | 94 |
| 2 | 33 | Argentina | 93 |
| 3 | 30 | Brazil | 92 |

None of the above

pd.datframe(lst, column = [‘Age’,’Nationality’,’Overall’],index = [1,2,3])

pd.Dataframe(lst, columns = col, index = [1,2,3])

pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

pd.Dateframe(lst, column = [‘Age’,’Nationality’,’Overall’], index = [1,2,3])

In [6]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age', 'Nationality', 'Overall']
pd.DataFrame(lst, columns=col, index=[1,2,3])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [7]:
pd.DataFrame(lst, columns=['Age', 'Naionality', 'Overall'], index=[1,2,3])

   Age Naionality  Overall
1   35   Portugal       94
2   33  Argentina       93
3   30     Brazil       92

In [8]:
pd.DataFrame(lst, columns=col, index=[i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

##### Option 3,4,5 is correct

5. Answer the following questions based on the African food production dataset provided by the FAO website already provided

What is the total sum of Wine produced in 2015 and 2018 respectively?

Hint:

Perform a groupby sum aggregation on ‘Item’

Options
20675.72 and 26968.27

2134.34 and 3517.22

4251.81 and 4039.32

1584.08 and 1387.21

In [9]:
wine = food_data.groupby('Item')['Y2015', 'Y2018'].sum()
wine

                         Y2015      Y2018
Item
Alcohol, Non-Food      2180.00    2293.00
Alcoholic Beverages   98783.72   97847.27
Animal Products       11811.73   11578.61
Animal fats          200675.72  269648.27
Apples and products   10559.15    9640.51
...                        ...        ...
Vegetables, Other    158104.08  163987.21
Vegetal Products     107064.17  107775.39
Wheat and products   234710.51  242645.19
Wine                   4251.81    4039.32
Yams                 203151.78  221272.09

[119 rows x 2 columns]

##### Option 3 is correct

6. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

Options
Cabo Verde

Ghana

Seychelles

Guinea-Bissau

Comoros

In [10]:
food_data.groupby('Area')['Y2017'].sum().sort_values()[:10]

Area
Sudan (former)               0.00
Ethiopia PDR                 0.00
Comoros                     59.84
Seychelles                 442.34
Sao Tome and Principe    12662.63
Cabo Verde               14650.74
Guinea-Bissau            19102.77
Lesotho                  21267.96
Botswana                 22101.30
Djibouti                 22729.91
Name: Y2017, dtype: float64

##### Option 3 is correct

7. What is the total Protein supply quantity in Madagascar in 2015?

Options
174.91

357.12

173.05

180.29

In [11]:
food_data[food_data.Area == 'Madagascar'].groupby('Element')['Y2015'].sum()

Element
Domestic supply quantity                  31214.98
Export Quantity                             494.75
Fat supply quantity (g/capita/day)           91.85
Feed                                       2070.22
Food                                      21120.65
Food supply (kcal/capita/day)              7685.00
Food supply quantity (kg/capita/yr)         871.59
Import Quantity                            1721.80
Losses                                     2176.00
Other uses (non-food)                      3957.12
Processing                                 1803.00
Production                                29482.89
Protein supply quantity (g/capita/day)      173.05
Residuals                                  -616.00
Seed                                        699.00
Stock Variation                            -505.00
Total Population - Both sexes             24234.00
Name: Y2015, dtype: float64

##### Option 3 is correct

8. Given the following python code, what would the output of the code give?

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

Options
Math Error

Standard Error

Value Error

Type Error

In [12]:
my_tuple = (1,2,5,8)
my_tuple[2] = 6

TypeError: 'tuple' object does not support item assignment

##### Option 4 is correct

9. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

Options
Kenya

Egypt

South Africa

Ethiopia

Nigeria

In [13]:
food_data.groupby('Area')['Y2017'].sum().sort_values(ascending=False)[:5]

Area
Nigeria         1483268.23
Egypt            866379.92
South Africa     517590.54
Ethiopia         448683.76
Morocco          388495.36
Name: Y2017, dtype: float64

##### Option 4 is correct

10. Which of the following is a python inbuilt module?

Options

Math

Seaborn

Pandas

Matplotlib

##### Option 1 is correct

11. Consider the following list of tuples:

y = [(2, 4), (7, 8), (1, 5, 9)]

How would you assign element 8 from the list to a variable x?

Options
x = y[1][-1]

x = y[1][-2] 

x = y[2][-1]

x = y[1][1]

In [14]:
y = [(2, 4), (7, 8), (1, 5, 9)]
print(y[1])
print(y[1][-1])
print(y[1][1])

(7, 8)
8
8

##### Option 1,4 is correct

12. A pandas Dataframe with dimensions (100,3) has how many features and observations?

Options
100 features, 3 observations.

100 rows and 3 observations.

A pandas dataframe has no attribute feature or observation.

3 features, 100 observations

The pandas Dataframe has 3 features and 100 observations

##### Option 1 is correct

13. Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

Options
2015

2014

2016

2017

In [15]:
food_data.iloc[:, -5:-1].columns

Index(['Y2014', 'Y2015', 'Y2016', 'Y2017'], dtype='object')

In [16]:
food_data.groupby('Element')[food_data.iloc[:, -5:-1].columns].sum()

,Y2014,Y2015,Y2016,Y2017
Element,,,,
Domestic supply quantity,1996716.35,2021493.55,2044842.70,2088198.10
Export Quantity,150020.64,157614.47,151920.46,182338.80
Fat supply quantity (g/capita/day),10225.56,10235.74,10102.77,10253.84
Feed,216927.89,225050.22,228958.65,223705.68
Food,1212332.49,1232361.10,1247022.17,1258888.28
Food supply (kcal/capita/day),454257.00,453383.00,451810.00,454681.00
Food supply quantity (kg/capita/yr),49650.63,49345.13,48985.28,48690.04
Import Quantity,274144.48,267018.46,286582.78,294559.09
Losses,153223.00,155439.00,157787.00,160614.00
Other uses (non-food),78718.13,66254.41,69563.68,91645.97
Processing,282923.00,287929.00,280631.00,292836.00
Production,1931287.75,1947019.39,1943537.15,2030056.89
Protein supply quantity (g/capita/day),11836.46,11833.95,11779.69,11842.45
Residuals,30149.00,30045.00,37224.00,35500.00
Seed,21922.92,23976.82,23389.20,24870.14
Stock Variation,58749.83,34910.99,33140.12,54316.91
Total Population - Both sexes,1031585.00,1058081.00,1085107.00,1112641.00
Tourist consumption,416.00,349.00,89.00,91.00

##### Option 2 is correct

14. Which year had the least correlation with ‘Element Code’?

Options
2015

2017

2016

2014

In [17]:
food_data.corr()['Element Code']

Area Code      -0.000209
Item Code      -0.024683
Element Code    1.000000
Y2014           0.024457
Y2015           0.023889
Y2016           0.023444
Y2017           0.024254
Y2018           0.024279
Name: Element Code, dtype: float64

##### Option 3 is correct

15. Which of the following dataframe methods can be used to access elements across rows and columns?

Options
df.iloc( )

df.loc( )

df.loc( : )

c and d

df.iloc[ : ]

##### Option 5 is correct

16. What is the total number and percentage of missing data in 2014 to 3 decimal places?

Options
1506 and 2.477%

1598 and 2.617%

1538 and 2.522%

1473 and 2.152 %

1589 and 2.607%

In [18]:
food_data.isnull().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

In [19]:
food_data.isnull().sum().loc['Y2014'] / food_data.shape[0] * 100

2.6073544131401474

##### Option 5 is correct

17. Given the following numpy array 

array  = ([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])

How would you select  the elements in bold and italics from the array?

Options
array[ : 1, 1 : ]

array[ 1 : , : ]

array[ : 1, 1 :] 

array[ : 2, 0 : ]

array[ : 2, 1 : ]

In [20]:
array = np.array([[94, 89, 63],
                  [93, 92, 48],
                  [92, 94, 56]])
array

array([[94, 89, 63],
       [93, 92, 48],
       [92, 94, 56]])

In [21]:
array[:2, 1:]

array([[89, 63],
       [92, 48]])

##### Option 5 is correct

18. Which of these python data structures is unorderly?

Options
Tuple

List

Dictionary

Set

##### Option 4 is correct

19. How would you check for the number of rows and columns in a pandas DataFrame named df?

Options
df.shape

df.shape( )

pd.length(df)

 len(df)

In [22]:
food_data.shape

(60943, 12)

##### Option 1 is correct

20. 
What is the total number of unique countries in the dataset?

Options
50

45

49

39

In [23]:
len(food_data.Area.unique())

49

##### Option 3 is correct